<?php

namespace Database\Seeders;

use App\Models\Article;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ArticleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $url = 'http://127.0.0.1:8000/images/article_image/';
        Article::create([
            'title' => ' تقنية البومودورو (Pomodoro Technique)',
            'content' => 'هي طريقة لإدارة الوقت تم تطويرها من قبل فرانشيسكو سيريلو في أواخر الثمانينيات. صُممّت لمساعدة الأفراد على تعزيز إنتاجيتهم وتركيزهم من خلال تقسيم العمل إلى فترات مركزة، عادة مدتها 25 دقيقة، تليها فترات استراحة قصيرة. تم تسمية هذه الطريقة باسم الكلمة الإيطالية “الطماطم” المستمدة من مؤقت المطبخ على شكل طماطم الذي كان يستخدمه فرانشيسكو  لضبط مدّة فترات عمله',
            'title1' => 'تقنية البومودورو ودورها الفعال في إدارة الوقت وزيادة الإنتاجية',
            'title2' => ' أهمية تقنية البومودورو في عدة فوائد رئيسية',
            'title3' => 'كيفية تطبيق تقنية البومودورو خطوة بخطوة',
            'content1' => 'في عالم يبدو  فيه أن الوقت ينساب بين أصابعنا وسط سرعة المعلومات والمهام، أصبح إتقان فن إدارة الوقت أكثر أهمية من أي وقت مضى. وسط هذه الخلفية الديناميكية، تبرز تقنية البومودورو كوجه يمكنه مساعدتنا على تحقيق الإنتاجية وتحسين إدارتنا للوقت بفاعلية من خلال نهجها المباشر وقابليتها للتكيف، ثبتت هذه التقنية أنها رفيقٌ موثوق لأولئك الذين يسعون لاستثمار
تركيزهم وزيادة إنتاجهم',
            'content2' => '•	تعزيز التركيز والانتباه: يساعد هذا النهج المنظم على العمل في فترات قصيرة مركزة تليها فترات استراحة على تحسين التركيز خلال فترة عمل مدتها 25 دقيقة (التي تعرف باسم “بومودورو”)
•	التقليل من التسويف: تشجع الطريقة على البدء في العمل لمهمة واحدة خلال فترة محددة مع ضرورة الالتزام بالمدة القصيرة لها مما يسهل من التغلب على التسويف
•	تقليل الإرهاق: من خلال دمج فترات الاستراحة بانتظام، تساعد تقنية البومودورو على تقليل الإرهاق العقلي الذي قد يحدث نتيجة لفترات طويلة من العمل المستمر. توفر الفترات القصيرة للراحة فرصة للاسترخاء والتجديد.
•	إدارة الوقت: تعزز تقنية البومودورو من إدارة الوقت الفعالة من خلال تقسيم المهام الكبيرة إلى مجموعات أصغر وأكثر إدارة. هذا النهج يسهل من عمليات تقدير مقدار الوقت الذي تحتاجه بعض المهام وتخصيص الوقت وفقًا لذلك.
•	التقدم التدريجي: إكمال عدّة بومودوروات خلال اليوم يؤدي إلى تقدم تدريجي في المهام. مع مرور الوقت، تتراكم هذه الإنجازات الصغيرة، مما يؤدي إلى شعور بالإنجاز والحافز للمتابعة
•	تحسين تحديد أولويات المهام: تشجع التقنية على اختيار مهمة واحدة للتركيز عليها خلال كل جلسة بومودورو. تساعد هذه الطريقة في تحسين تحديد أولويات المهام عن طريق ضمان العمل على ما هو أهم وأكثر استعجالًا.
•	الوعي بالوقت: يساعد استخدام المؤقتات في خلق وعي أعلى مع مرور الوقت.',
            'content3' => 'اختر المهمة:
حدد المهمة التي ترغب في التعامل معها. يمكن أن تكون كتابة مقال، أو دراسة، أو برمجة مشروع.
اضبط المؤقت:
ضبط المؤقت لمدة 25 دقيقة (بومودورو واحد).
استخدم هاتفك الذكي، أو تطبيق البومودورو، أو مؤقتًا ماديًا.
اعمل بتركيز:
التركيز بشكل حصري على مهمتك أثناء البومودورو.
قاوم رغبتك في القيام بأكثر من مهمة أو التحقق من هاتفك والتشتت.
خذ استراحة:
بعد انتهاء فترة البومودورو، خذ استراحة لمدة 5 دقائق.
تمدد وتنزه أو افعل شيئًا ممتعًا أو حتى يكفي أن تتحرك بعيدًا عن الكرسي وشرب الماء.
كرّر واسترح:
بعد إكمال أربع فترات بومودورو، خذ استراحة أطول (15-30 دقيقة).
هذا يكافئ عملك الجاد ويتيح لك شحن طاقتك أكثر
',
            'imge' => $url . 'pomodoro_technique.jpg',
            'type' => '0'
        ]);
        Article::create([
            'title' => 'تعليمات التسجيل لاختبار الترشح للتقدم لامتحان الشهادة الثانوية العامة بصفة دراسة حرة بفرعيها الأدبي والعلمي لدورة ٢٠٢٤م',
            'content' => 'وزارة التربية تعمم على مديرياتها في المحافظات تعليمات التسجيل لاختبار الترشح للتقدم لامتحان الشهادة الثانوية العامة بصفة دراسة حرة بفرعيها الأدبي والعلمي لدورة ٢٠٢٤م، حيث يبدأ التسجيل اعتباراً من يوم الأحد الواقع في ٢٢/١٠/٢٠٢٣م ولغاية يوم الخميس الواقع في ٩/١١/٢٠٢٣م، على أن يجرى الامتحان المؤتمت الساعة العاشرة من صباح يوم السبت الواقع في ٢٥/١١/٢٠٢٣م في المراكز المعتمدة من قبل مديريات التربية ولمدة ثلاث ساعات وفي جميع المواد المقررة لكل فرع',
            'title1' => 'شروط التقدم للاختبار',
            'title2' => 'الأوراق المطلوبة للتسجيل في الاختبار',
            'title3' => 'وثائق إثبات الشخصية للتسجيل للاختبار',
            'content1' => '- يقبل الطلاب الراغبون بالتقدم لاختبار الترشيح لامتحان الشهادة الثانوية العامة بصفة دراسة حرة بفرعيها العلمي - ا العِلْمِي - الأدبي) إذا توافر أحد الشرطين الآتيين:
أ – الذين مضى على حيازتهم شهادة التعليم الأساسي أو الإعدادية الشرعية أو ما يعادلها ثلاث سنوات على الأقل.
ب – تجاوز الثامنة عشر من عمره ولم يمض ثلاث سنوات على حصول الطالب شهادة التعليم الأساسي أو الإعدادية الشرعية أو ما يعادلهما ومن مواليد ٢٥ /٢٠٠٦/٥م وما قبل.
',
            'content2' => '1)	طلب تسجيل يؤخذ من دائرة الامتحانات يدون عليه الطالب وعلى مسؤوليته المعلومات المطلوبة كافة مع. بشكل مفصل وواضح ورقم الهاتف يلصق عليه طابع مالي وطابع الهلال الأحمر وطابع نقابة معلمين وطابع المجهود الحربي.
2)	 صورة مصدقة عن شهادة التعليم الأساسي أو الإعدادية أو الإعدادية الشرعية أو ما يعادلها .
3)	ثلاث صور شخصية حديثة قياس (٤٣) يكتب خلف كل منهما اسم الطالب.
4)	صورة عن الهوية الشخصية ملصق عليها طابع مالي وطابع الهلال الأحمر.
5)	إضافة عبارة أبناء الشهداء أو عبارة جرحى الحرب لحاملي الوثائق الرسمية في حقل الملاحظات أثناء التسجيل.
6)	 صورة قيد السجل المدني للعسكريين يتضمن اسم شعبة التجنيد التي يتبع لها الطالب) تنظمه قيادة الوحدة على نسختين ملصق على كل منهما طابع مالي وطابع الهلال الأحمر وصورة شخصية مطابقة للصور المرافقة لطلب التسجيل ممهورة بختم الوحدة مع عبارة صالحة فقط للتقدم إلى الاختبار في محافظة (........) المحافظة التي يؤدي العسكري خدمته فيها ممهورة بخاتم الوحدة أيضاً.
7)	 يسمح للطلبة الأحرار المتقدمين لاختبار الترشح الذين تقدموا بوثائق غير مصدقة أو بحاجة للتحقق من صحة الوثيقة من البلد المانح لها بالتقدم اللاختبار شرطياً على ألا يتم تقدمهم للامتحانات العامة ما لم يتم إصدار قرار

',
            'content3' => '  هي وثائق إثبات الشخصية للتسجيل لامتحانات الشهادة الثانوية العامة(أدبي-علمي) في السنوات السابقة',
            'imge' => $url . 'default-image-1.jpg',
            'type' => '1'
        ]);
        Article::create([
            'title' => 'وزارة التربية تعمم برنامجي امتحانات الشهادة الثانوية العامة الدورة الثانية',
            'content' => 'وزارة التربية تعمم برنامجي امتحانات الشهادة الثانوية العامة بفرعيها العلمي والأدبي، والشهادة الثانوية الشرعية دورة عام ٢٠٢٤م (الدورة الثانية).',
            'title1' => '',
            'title2' => '',
            'title3' => '',
            'content1' => '',
            'content2' => '',
            'content3' => '',
            'imge' => $url . 'term2.jpg',
            'type' => '1'
        ]);
        Article::create([
            'title' => 'وزارة التربية تعمم برنامجي امتحانات الشهادة الثانوية العامة الدورة الاولى',
            'content' => 'وزارة التربية تعمم برنامجي امتحانات الشهادة الثانوية العامة بفرعيها العلمي والأدبي، والشهادة الثانوية الشرعية دورة عام ٢٠٢٤م (الدورة الاولى).',
            'title1' => '',
            'title2' => '',
            'title3' => '',
            'content1' => '',
            'content2' => '',
            'content3' => '',
            'imge' => $url . 'term1.jpg',
            'type' => '1'
        ]);
        Article::create([
            'title' => 'تقسيم الوقت: أداة بسيطة لزيادة الإنتاجية (Time Blocking)',
            'content' => 'تقسيم الوقت هو أسلوب إدارة الوقت يتضمن جدولة يومك إلى فترات زمنية محددة مخصصة لمهام أو أنشطة معينة. بدلاً من محاولة القيام بأكثر من مهمة في نفس الوقت أو العمل على المهام بشكل متقطع طوال اليوم، تخصص فترات زمنية معينة للتركيز على مهمة واحدة في كل مرة.',
            'title1' => 'خطوات تقسيم الوقت',
            'title2' => 'الفوائد من تقسيم الوقت',
            'title3' => 'نصائح لتطبيق تقسيم الوقت',
            'content1' => '1. خطط يومك:
في بداية كل يوم أو في الليلة السابقة، قم بأخذ بضع دقائق لتخطيط يومك. حدد المهام التي تحتاج إلى إنجازها وقم بتخصيص فترات زمنية محددة للعمل على كل مهمة.

2. إنشاء فترات زمنية:
 قسّم يومك إلى فترات زمنية، تتراوح عادة بين 30 دقيقة وساعتين، اعتمادًا على المهمة وتفضيلاتك. قم بتخصيص كل فترة زمنية لمهمة أو نشاط معين.

3.التخلص من الانحرافات:
خلال كل فترة زمنية، قم بالتخلص من الانحرافات والتركيز فقط على المهمة التي تقوم بها. قم بإيقاف تشغيل إشعارات هاتفك، واغلق علامات التبويب غير الضرورية على جهاز الكمبيوتر الخاص بك، وابحث عن مكان هادئ للعمل إذا كان ذلك ممكنًا.
',
            'content2' => 'سهولة تحقيق الهدف والوصول إليه. التخلص من الطاقة السلبية التي تهدر طاقة الفرد، وهذا يتضمن بالتأكيد طرد الحزن والكآبة والقلق. خلق حافز يشجع على المزيد من العمل والإبداع. الشعور بالنجاح والفخر ولذة الإنجاز، وهو ما يضمن إنجاز المزيد من المهام والبعد عن التأجيل.',
            'content3' => '•	تحديد ما يضيع وقتك
•	الإلتزام بمواعيد محددة
•	تحديد الأولويات
•	البدء بالاصعب
•	أداء المهام المماثلة معًا
•	ضع أوقات منطقية
•	تعلم متى تقول لا
•	حافظ على كل شئ منظم

',
            'imge' => $url . 'Group 11.png',
            'type'=>'0'
        ]);
        // Article::create([
        //     'title' => '',
        //     'content' => '',
        //     'title1' => '',
        //     'title2' => '',
        //     'title3' => '',
        //     'content1' => '',
        //     'content2' => '',
        //     'content3' => '',
        //     'imge' => $url . ''
        // ]);
    }
}
